src/InformationRegisters/ДанныеВложений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ДанныеВложений</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Данные</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Вложение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Вложения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/ТипыДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыДокументов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Инструкция</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Гарантия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Договор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Чек</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Акт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Страховка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Фотография</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/Вложения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>Вложения</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Предмет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Вещи</v8:Type>
						<v8:Type>cfg:CatalogRef.ОбъектыНедвижимости</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипДокумента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДействуетДо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НапомнитьЗаДней</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>260</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Расширение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Размер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заметка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/CommonModules/Вложения/Ext/Module.bsl
// Сервис вложений (ADR-002, ARCHITECTURE §12): фото и файлы вещей и домов.
// Справочник хранит только метаданные файла, двоичные данные — в регистре
// ДанныеВложений; формы работают с данными только через этот модуль.
// Тексты, видимые пользователю, — по словарю (docs/GLOSSARY.md): вложение
// в интерфейсе — «документ», «фото» или «файл».

#Область ПрограммныйИнтерфейс

// Сохраняет файл как документ вещи или дома и возвращает ссылку на него.
// Документ и его данные записываются одной транзакцией.
//
// Параметры:
//  Предмет        - СправочникСсылка.Вещи, СправочникСсылка.ОбъектыНедвижимости -
//                   вещь или дом, к которым относится файл
//  ДвоичныеДанные - ДвоичныеДанные - содержимое файла, не больше 20 МБ (ADR-002)
//  ИмяФайла       - Строка - имя файла, как передано; расширение из него
//                   сохраняется без точки в нижнем регистре
//  ТипДокумента   - ПеречислениеСсылка.ТипыДокументов - необязательно; по умолчанию
//                   «Фотография» для изображений, остальным файлам — «Прочее»
//  Наименование   - Строка - необязательно; если пустое, берётся имя файла без
//                   расширения, а для снимков без имени — «Фото 02.10.2026»
//
// Возвращаемое значение:
//  СправочникСсылка.Вложения
//
Функция Добавить(Предмет, ДвоичныеДанные, ИмяФайла, ТипДокумента = Неопределено, Наименование = "") Экспорт

	Если НЕ ЗначениеЗаполнено(Предмет) Тогда
		ВызватьИсключение НСтр("ru = 'Файл не привязан к вещи или дому. Сохраните карточку и попробуйте ещё раз.'");
	КонецЕсли;
	ПроверитьФайл(ДвоичныеДанные);

	НачатьТранзакцию();
	Попытка
		Вложение = СоздатьВложение(Предмет, ДвоичныеДанные, ИмяФайла, ТипДокумента, Наименование);
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;

	Возврат Вложение;

КонецФункции

// Сохраняет файл как документ, как и Добавить, но клиент передаёт файл адресом
// временного хранилища: большие двоичные данные не ходят параметром вызова.
//
// Параметры:
//  Предмет      - СправочникСсылка.Вещи, СправочникСсылка.ОбъектыНедвижимости
//  Адрес        - Строка - адрес двоичных данных во временном хранилище
//  ИмяФайла     - Строка
//  ТипДокумента - ПеречислениеСсылка.ТипыДокументов - необязательно
//  Наименование - Строка - необязательно
//
// Возвращаемое значение:
//  СправочникСсылка.Вложения
//
Функция ДобавитьИзХранилища(Предмет, Адрес, ИмяФайла, ТипДокумента = Неопределено, Наименование = "") Экспорт

	Возврат Добавить(Предмет, ДвоичныеДанныеИзХранилища(Адрес), ИмяФайла, ТипДокумента, Наименование);

КонецФункции

// Возвращает содержимое файла документа.
//
// Параметры:
//  Вложение - СправочникСсылка.Вложения
//
// Возвращаемое значение:
//  ДвоичныеДанные - Неопределено, если документа нет или файл не сохранён
//
Функция Данные(Вложение) Экспорт

	Если НЕ ЗначениеЗаполнено(Вложение) Тогда
		Возврат Неопределено;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ДанныеВложений.Данные КАК Данные
	|ИЗ
	|	РегистрСведений.ДанныеВложений КАК ДанныеВложений
	|ГДЕ
	|	ДанныеВложений.Вложение = &Вложение";
	Запрос.УстановитьПараметр("Вложение", Вложение);
	Выборка = Запрос.Выполнить().Выбрать();

	Если НЕ Выборка.Следующий() Тогда
		Возврат Неопределено;
	КонецЕсли;
	Возврат Выборка.Данные.Получить();

КонецФункции

// Проверяет, есть ли у документа сохранённый файл, не читая сами данные.
//
// Параметры:
//  Вложение - СправочникСсылка.Вложения
//
// Возвращаемое значение:
//  Булево
//
Функция ЕстьДанные(Вложение) Экспорт

	Если НЕ ЗначениеЗаполнено(Вложение) Тогда
		Возврат Ложь;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ДанныеВложений.Вложение КАК Вложение
	|ИЗ
	|	РегистрСведений.ДанныеВложений КАК ДанныеВложений
	|ГДЕ
	|	ДанныеВложений.Вложение = &Вложение";
	Запрос.УстановитьПараметр("Вложение", Вложение);

	Возврат Запрос.Выполнить().Выбрать().Следующий();

КонецФункции

// Помечает документ на удаление. Данные файла стираются, а если файл был
// основным фото вещи — фото у вещи очищается; всё это делает модуль объекта
// в ПередЗаписью при новой пометке, в одной транзакции с пометкой.
//
// Параметры:
//  Вложение - СправочникСсылка.Вложения
//
Процедура Удалить(Вложение) Экспорт

	Если НЕ ЗначениеЗаполнено(Вложение) Тогда
		Возврат;
	КонецЕсли;

	НачатьТранзакцию();
	Попытка
		ЗаблокироватьВложение(Вложение);

		Документ = Вложение.ПолучитьОбъект();
		Если Документ = Неопределено Тогда
			ВызватьИсключение НСтр("ru = 'Этот документ уже не существует. Обновите список и попробуйте ещё раз.'");
		КонецЕсли;
		Документ.ПометкаУдаления = Истина;
		Документ.Записать();

		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;

КонецПроцедуры

// Сохраняет фото как основной снимок вещи: добавляет документ типа «Фотография»
// и записывает его в поле «ОсновноеФото» вещи. Одной транзакцией.
//
// Параметры:
//  Вещь           - СправочникСсылка.Вещи - уже сохранённая вещь
//  ДвоичныеДанные - ДвоичныеДанные - снимок камеры
//  ИмяФайла       - Строка - имя файла, например «Фото 02.10.2026.jpg»
//
// Возвращаемое значение:
//  СправочникСсылка.Вложения
//
Функция УстановитьОсновноеФото(Вещь, ДвоичныеДанные, ИмяФайла) Экспорт

	Если НЕ ЗначениеЗаполнено(Вещь) Тогда
		ВызватьИсключение НСтр("ru = 'Вещь ещё не сохранена. Сохраните карточку и попробуйте ещё раз.'");
	КонецЕсли;
	ПроверитьФайл(ДвоичныеДанные);

	НачатьТранзакцию();
	Попытка
		Блокировка = Новый БлокировкаДанных;
		ЭлементВещи = Блокировка.Добавить("Справочник.Вещи");
		ЭлементВещи.Режим = РежимБлокировкиДанных.Исключительный;
		ЭлементВещи.УстановитьЗначение("Ссылка", Вещь);
		Блокировка.Заблокировать();

		Фото = СоздатьВложение(Вещь, ДвоичныеДанные, ИмяФайла,
			Перечисления.ТипыДокументов.Фотография, "");

		ОбъектВещи = Вещь.ПолучитьОбъект();
		Если ОбъектВещи = Неопределено Тогда
			ВызватьИсключение НСтр("ru = 'Эта вещь уже не существует. Обновите список и попробуйте ещё раз.'");
		КонецЕсли;
		ОбъектВещи.ОсновноеФото = Фото;
		ОбъектВещи.Записать();

		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;

	Возврат Фото;

КонецФункции

// Сохраняет снимок как основное фото вещи, как и УстановитьОсновноеФото, но файл
// клиент передаёт адресом временного хранилища.
//
// Параметры:
//  Вещь     - СправочникСсылка.Вещи
//  Адрес    - Строка - адрес двоичных данных во временном хранилище
//  ИмяФайла - Строка
//
// Возвращаемое значение:
//  СправочникСсылка.Вложения
//
Функция УстановитьОсновноеФотоИзХранилища(Вещь, Адрес, ИмяФайла) Экспорт

	Возврат УстановитьОсновноеФото(Вещь, ДвоичныеДанныеИзХранилища(Адрес), ИмяФайла);

КонецФункции

// Проверяет расширение файла: jpg, jpeg, png, heic, webp.
//
// Параметры:
//  Расширение - Строка - расширение без точки; регистр не важен
//
// Возвращаемое значение:
//  Булево
//
Функция ЭтоИзображение(Знач Расширение) Экспорт

	Расширение = НРег(СокрЛП(Расширение));
	Возврат Расширение = "jpg"
		Или Расширение = "jpeg"
		Или Расширение = "png"
		Или Расширение = "heic"
		Или Расширение = "webp";

КонецФункции

// Помещает изображение документа во временное хранилище формы — для показа
// в поле с картинкой.
//
// Параметры:
//  Вложение           - СправочникСсылка.Вложения
//  ИдентификаторФормы - УникальныйИдентификатор - форма, в контексте которой
//                       живёт временное хранилище
//
// Возвращаемое значение:
//  Строка - адрес во временном хранилище; "" — если документ пустой,
//           не изображение или без данных
//
Функция ПоместитьДляПросмотра(Вложение, ИдентификаторФормы) Экспорт

	Если НЕ ЗначениеЗаполнено(Вложение) Тогда
		Возврат "";
	КонецЕсли;
	Если НЕ ЭтоИзображение(Вложение.Расширение) Тогда
		Возврат "";
	КонецЕсли;

	Возврат ПоместитьФайл(Вложение, ИдентификаторФормы);

КонецФункции

// Помещает файл документа во временное хранилище формы — чтобы клиент мог
// сохранить файл на устройство и открыть.
//
// Параметры:
//  Вложение           - СправочникСсылка.Вложения
//  ИдентификаторФормы - УникальныйИдентификатор
//
// Возвращаемое значение:
//  Строка - адрес во временном хранилище; "" — если файла нет
//
Функция ПоместитьФайл(Вложение, ИдентификаторФормы) Экспорт

	Данные = Данные(Вложение);
	Если Данные = Неопределено Тогда
		Возврат "";
	КонецЕсли;

	Возврат ПоместитьВоВременноеХранилище(Данные, ИдентификаторФормы);

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Создаёт документ и запись данных; вызывается внутри транзакции вызывающего метода.
Функция СоздатьВложение(Предмет, ДвоичныеДанные, ИмяФайла, ТипДокумента, Наименование)

	Расширение = РасширениеФайла(ИмяФайла);

	Если ПустаяСтрока(Наименование) Тогда
		Наименование = ИмяБезРасширения(ИмяФайла);
		Если ПустаяСтрока(Наименование) Тогда
			Наименование = "Фото " + Формат(ТекущаяДатаСеанса(), "ДФ=dd.MM.yyyy");
		КонецЕсли;
	КонецЕсли;

	Если ТипДокумента = Неопределено Тогда
		ТипДокумента = ТипПоУмолчанию(Расширение);
	ИначеЕсли ТипДокумента.Пустая() Тогда
		ТипДокумента = ТипПоУмолчанию(Расширение);
	КонецЕсли;

	Вложение = Справочники.Вложения.СоздатьЭлемент();
	Вложение.Наименование = Наименование;
	Вложение.Предмет = Предмет;
	Вложение.ТипДокумента = ТипДокумента;
	Вложение.ДатаДокумента = НачалоДня(ТекущаяДатаСеанса());
	Вложение.ИмяФайла = ИмяФайла;
	Вложение.Расширение = Расширение;
	Вложение.Размер = ДвоичныеДанные.Размер();
	Вложение.Записать();

	Набор = РегистрыСведений.ДанныеВложений.СоздатьНаборЗаписей();
	Набор.Отбор.Вложение.Установить(Вложение.Ссылка);
	Запись = Набор.Добавить();
	Запись.Вложение = Вложение.Ссылка;
	Запись.Данные = Новый ХранилищеЗначения(ДвоичныеДанные);
	Набор.Записать(Истина);

	Возврат Вложение.Ссылка;

КонецФункции

// Тип документа по расширению: «Фотография» для изображений, «Прочее» для остальных.
Функция ТипПоУмолчанию(Расширение)

	Если ЭтоИзображение(Расширение) Тогда
		Возврат Перечисления.ТипыДокументов.Фотография;
	КонецЕсли;
	Возврат Перечисления.ТипыДокументов.Прочее;

КонецФункции

// Расширение файла без точки, в нижнем регистре; "" — если расширения нет.
Функция РасширениеФайла(ИмяФайла)

	// Расширение — то, что после последней точки; точка в начале или в конце
	// имени расширения не даёт («.profile», «Инструкция.v2.»).
	Имя = СокрЛП(ИмяФайла);
	Позиция = СтрНайти(Имя, ".", НаправлениеПоиска.СКонца);
	Если Позиция <= 1 Или Позиция = СтрДлина(Имя) Тогда
		Возврат "";
	КонецЕсли;
	Возврат НРег(Сред(Имя, Позиция + 1));

КонецФункции

// Имя файла без расширения; пустая строка для файлов из одного расширения.
Функция ИмяБезРасширения(ИмяФайла)

	Имя = СокрЛП(ИмяФайла);
	Расширение = РасширениеФайла(Имя);
	Если ПустаяСтрока(Расширение) Тогда
		Возврат Имя;
	КонецЕсли;
	Возврат СокрЛП(Лев(Имя, СтрДлина(Имя) - СтрДлина(Расширение) - 1));

КонецФункции

// Проверяет файл перед сохранением: заполненность и лимит 20 МБ (ADR-002).
Процедура ПроверитьФайл(ДвоичныеДанные)

	Если ТипЗнч(ДвоичныеДанные) <> Тип("ДвоичныеДанные") Тогда
		ВызватьИсключение НСтр("ru = 'Файл пустой и не сохранился. Выберите другой файл.'");
	КонецЕсли;
	Если ДвоичныеДанные.Размер() = 0 Тогда
		ВызватьИсключение НСтр("ru = 'Файл пустой и не сохранился. Выберите другой файл.'");
	КонецЕсли;
	Если ДвоичныеДанные.Размер() > 20 * 1024 * 1024 Тогда
		ВызватьИсключение НСтр("ru = 'Файл больше 20 МБ. Выберите файл поменьше.'");
	КонецЕсли;

КонецПроцедуры

// Читает двоичные данные из временного хранилища: клиент передаёт файлы адресом.
Функция ДвоичныеДанныеИзХранилища(Адрес)

	Значение = ПолучитьИзВременногоХранилища(Адрес);
	Если ТипЗнч(Значение) <> Тип("ДвоичныеДанные") Тогда
		ВызватьИсключение НСтр("ru = 'Не получилось прочитать файл. Попробуйте добавить его ещё раз.'");
	КонецЕсли;
	Возврат Значение;

КонецФункции

// Блокирует документ и его данные для изменения, управляемой блокировкой.
Процедура ЗаблокироватьВложение(Вложение)

	Блокировка = Новый БлокировкаДанных;
	ЭлементДанных = Блокировка.Добавить("РегистрСведений.ДанныеВложений");
	ЭлементДанных.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементДанных.УстановитьЗначение("Вложение", Вложение);
	ЭлементДокумента = Блокировка.Добавить("Справочник.Вложения");
	ЭлементДокумента.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементДокумента.УстановитьЗначение("Ссылка", Вложение);
	Блокировка.Заблокировать();

КонецПроцедуры

#КонецОбласти
